reversing/gowin-eda.org
#+TITLE: Reverse engineering and bypassing the Gowin EDA
#+AUTHOR: 8dcc
#+STARTUP: nofold
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../img/favicon.png">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css">
#+HTML_LINK_UP: index.html
#+HTML_LINK_HOME: ../index.html

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

The [[https://wiki.sipeed.com/hardware/en/tang/Tang-Nano-9K/Nano-9K.html][Tang Nano 9K]] is a development board made by Sipeed, which uses a Gowin
[[https://cdn.gowinsemi.com.cn/DS117E.pdf][GW1NR-9]] FPGA chip. Different steps are needed to program an FPGA, including
synthetization, place and route, and the programming itself. The /Gowin EDA/
(Electronic Design Automation) tool was developed by Gowin to perform all these
tasks from a single GUI program.

For this article, the GNU/Linux version of Gowin EDA 1.9.12.02 will be used,
which can be downloaded from [[https://www.gowinsemi.com/en/support/download_eda][this link]]. I have personally installed it from the
[[https://aur.archlinux.org/packages/gowin-eda-ide][Arch User Repository]] (AUR), and the file structure after the installation is:

- =/opt/gowin-eda-ide/=: Main installation directory of the Gowin EDA. Contains
  binaries, libraries, data, etc.
- =/usr/bin/gw_ide=: Simple script which exports the Gowin library path
  (=/opt/gowin-eda-ide/lib=) for the dynamic loader and transfers control to the
  main binary (=/opt/gowin-eda-ide/bin/gw_ide=).

By inspecting the type of that binary, we can determine that it is a 64-bit ELF
executable whose symbols have been stripped.

#+begin_src
$ file /opt/gowin-eda-ide/bin/gw_ide
/opt/gowin-eda-ide/bin/gw_ide: ELF 64-bit LSB executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, for GNU/Linux 2.6.32, stripped
#+end_src

Note that this article will use the CLI version of [[https://rizin.re/][Rizin]], an open-source reverse
engineering framework, but other GUI tools such as [[https://cutter.re/][Cutter]], [[https://ghidra-sre.org/][Ghidra]] or [[https://hex-rays.com/ida-pro][IDA Pro]].

* Locating the license validation code
:PROPERTIES:
:CUSTOM_ID: locating-the-license-validation-code
:END:

That binary file is not too big for an executable, only around 69 kilobytes in
size, but it's worth having a look inside, since it must either contain or call
the license validation code. First, tell rizin to analyze the binary with =aaa=.

#+begin_src
$ rizin /opt/gowin-eda-ide/bin/gw_ide
[0x0040563d]> aaa
[x] Analyze all flags starting with sym. and entry0 (aa)
[x] Analyze function calls
[x] Analyze len bytes of instructions for references
[x] Check for classes
[x] Analyze local variables and arguments
[x] Type matching analysis for all functions
[x] Applied 0 FLIRT signatures via sigdb
[x] Propagate noreturn information
[x] Integrate dwarf function information.
[x] Resolve pointers to data sections
[x] Use -AA or aaaa to perform additional experimental analysis.
[0x0040563d]>
#+end_src

Then, we can take a look at the list of strings with the =iz= command. We can
filter the output of the command with the =~TERM= syntax; in this case, looking
for strings containing "license".

#+begin_src
[0x0040563d]> iz ~license
  7 0x0000d8a6 0x0040d8a6  29   30 .rodata ascii License verification failed.\n
  9 0x0000d8ca 0x0040d8ca  19   20 .rodata ascii /license_config_gui
 15 0x0000d920 0x0040d920  25   26 .rodata ascii License information lost.
 16 0x0000d93a 0x0040d93a  23   24 .rodata ascii License mode not match.
 17 0x0000d952 0x0040d952  25   26 .rodata ascii License hostid not match.
 18 0x0000d96c 0x0040d96c  26   27 .rodata ascii No more license available.
 27 0x0000da21 0x0040da21  23   24 .rodata ascii The license expires in
 29 0x0000da40 0x0040da40  26   27 .rodata ascii The license expires today.
 38 0x0000dac9 0x0040dac9  14   15 .rodata ascii /gwlicense.ini
 41 0x0000daf0 0x0040daf0  59   60 .rodata ascii Invalid license file, check if this file has been modified.
 42 0x0000db30 0x0040db30  72   73 .rodata ascii Software require license 2.0 file, please contact GOWIN for new license.
 44 0x0000dba8 0x0040dba8  31   32 .rodata ascii The license expires in one day.
 46 0x0000dbf8 0x0040dbf8  38   39 .rodata ascii License created by Gowin_LIC_Generator
#+end_src

There are a lot of matches. Furthermore, the unfiltered string list is not too
long, and it contains some interesting strings that stand out, like some public
and private keys. This means that we are probably in the right binary.

