reversing/gowin-eda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reverse engineering and bypassing the Gowin EDA</title>
<meta property="og:title" content="Reverse engineering and bypassing the Gowin EDA" />
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="org-div-home-and-up">
  <a accesskey="u" href="index.html">Up</a> | <a accesskey="h" href="../index.html">Home</a>
</div><div id="content" class="content">
<h1 class="title">Reverse engineering and bypassing the Gowin EDA</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#locating-the-license-validation-code">2. Locating the license validation code</a>
<ul>
<li><a href="#locating-the-top-level-validation-function">2.1. Locating the top-level validation function</a></li>
<li><a href="#analyzing-the-top-level-validation-function">2.2. Analyzing the top-level validation function</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
The <a href="https://wiki.sipeed.com/hardware/en/tang/Tang-Nano-9K/Nano-9K.html">Tang Nano 9K</a> is a development board made by Sipeed, which uses a Gowin
<a href="https://cdn.gowinsemi.com.cn/DS117E.pdf">GW1NR-9</a> FPGA chip. Different steps are needed to program an FPGA, including
synthetization, place and route, and the programming itself. The <i>Gowin EDA</i>
(Electronic Design Automation) tool was developed by Gowin to perform all these
tasks from a single GUI program.
</p>

<p>
For this article, the GNU/Linux version of Gowin EDA 1.9.12.02 will be used,
which can be downloaded from <a href="https://www.gowinsemi.com/en/support/download_eda">this link</a>. I have personally installed it from the
<a href="https://aur.archlinux.org/packages/gowin-eda-ide">Arch User Repository</a> (AUR), and the file structure after the installation is:
</p>

<ul class="org-ul">
<li><code>/opt/gowin-eda-ide/</code>: Main installation directory of the Gowin EDA. Contains
binaries, libraries, data, etc.</li>
<li><code>/usr/bin/gw_ide</code>: Simple script which exports the Gowin library path
(<code>/opt/gowin-eda-ide/lib</code>) for the dynamic loader and transfers control to the
main binary (<code>/opt/gowin-eda-ide/bin/gw_ide</code>).</li>
</ul>

<p>
By inspecting the type of that binary, we can determine that it is a 64-bit ELF
executable whose symbols have been stripped.
</p>

<pre class="example">
$ file /opt/gowin-eda-ide/bin/gw_ide
/opt/gowin-eda-ide/bin/gw_ide: ELF 64-bit LSB executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, for GNU/Linux 2.6.32, stripped
</pre>

<p>
Note that this article will use the CLI version of <a href="https://rizin.re/">Rizin</a>, an open-source reverse
engineering framework, but other GUI tools such as <a href="https://cutter.re/">Cutter</a>, <a href="https://ghidra-sre.org/">Ghidra</a> or <a href="https://hex-rays.com/ida-pro">IDA Pro</a>.
</p>
</div>
</div>

<div id="outline-container-locating-the-license-validation-code" class="outline-2">
<h2 id="locating-the-license-validation-code"><span class="section-number-2">2.</span> Locating the license validation code</h2>
<div class="outline-text-2" id="text-locating-the-license-validation-code">
<p>
That binary file is not too big for an executable, only around 69 kilobytes in
size, but it&rsquo;s worth having a look inside, since it must either contain or call
the license validation code. First, tell rizin to analyze the binary with <code>aaa</code>.
</p>

<pre class="example">
$ rizin /opt/gowin-eda-ide/bin/gw_ide
[0x0040563d]&gt; aaa
[x] Analyze all flags starting with sym. and entry0 (aa)
[x] Analyze function calls
[x] Analyze len bytes of instructions for references
[x] Check for classes
[x] Analyze local variables and arguments
[x] Type matching analysis for all functions
[x] Applied 0 FLIRT signatures via sigdb
[x] Propagate noreturn information
[x] Integrate dwarf function information.
[x] Resolve pointers to data sections
[x] Use -AA or aaaa to perform additional experimental analysis.
[0x0040563d]&gt;
</pre>

<p>
Then, we can take a look at the list of strings with the <code>iz</code> command. We can
filter the output of the command with the <code>~TERM</code> syntax; in this case, looking
for strings containing &ldquo;license&rdquo;.
</p>

<pre class="example">
[0x0040563d]&gt; iz ~license
  7 0x0000d8a6 0x0040d8a6  29   30 .rodata ascii License verification failed.\n
  9 0x0000d8ca 0x0040d8ca  19   20 .rodata ascii /license_config_gui
 15 0x0000d920 0x0040d920  25   26 .rodata ascii License information lost.
 16 0x0000d93a 0x0040d93a  23   24 .rodata ascii License mode not match.
 17 0x0000d952 0x0040d952  25   26 .rodata ascii License hostid not match.
 18 0x0000d96c 0x0040d96c  26   27 .rodata ascii No more license available.
 27 0x0000da21 0x0040da21  23   24 .rodata ascii The license expires in
 29 0x0000da40 0x0040da40  26   27 .rodata ascii The license expires today.
 38 0x0000dac9 0x0040dac9  14   15 .rodata ascii /gwlicense.ini
 41 0x0000daf0 0x0040daf0  59   60 .rodata ascii Invalid license file, check if this file has been modified.
 42 0x0000db30 0x0040db30  72   73 .rodata ascii Software require license 2.0 file, please contact GOWIN for new license.
 44 0x0000dba8 0x0040dba8  31   32 .rodata ascii The license expires in one day.
 46 0x0000dbf8 0x0040dbf8  38   39 .rodata ascii License created by Gowin_LIC_Generator
</pre>

<p>
There are a lot of matches. Furthermore, the unfiltered string list is not too
long, and it contains some interesting strings that stand out, like some public
and private keys. This means that we are probably in the right binary.
</p>
</div>
