reversing/gowin-eda.org
** Locating the top-level validation function
:PROPERTIES:
:CUSTOM_ID: locating-the-top-level-validation-function
:END:

From the strings we found, the "License verification failed" string is the most
promising. We can inspect its cross-references with the =axt= command. The =@
0x1234= syntax is used to execute an instruction at an specific address (instead
of the current one).

#+begin_src nasm
[0x0040563d]> axt @ 0x0040d8a6
main 0x40547e [DATA] lea rsi, str.License_verification_failed.
#+end_src

There is only one cross-reference, a =lea= instruction inside the =main=
function. We can inspect the disassembly of that function with the =pdf=
command. I have filtered the output to only show the relevant instructions.

#+begin_src nasm
[0x0040d8a6]> pdf @ 0x40547e

          ; Omitted...

│         0x00405421      be 01 00 00 00              mov     esi, 1 ; int64_t arg2
│         0x00405426      bf 01 00 00 00              mov     edi, 1 ; int64_t arg1
│         0x0040542b      e8 60 3a 00 00              call    fcn.00408e90 ; fcn.00408e90
│         0x00405430      85 c0                       test    eax, eax
│     ┌─< 0x00405432      75 31                       jne     0x405465
│     │   0x00405434      8b 7c 24 1c                 mov     edi, dword [rsp + 0x1c]
│     │   0x00405438      4c 89 f6                    mov     rsi, r14
│     │   0x0040543b      e8 f0 ee ff ff              call    imp.launchIDE(int, char**) ; sy
│     │   0x00405440      41 89 c4                    mov     r12d, eax
│     │   ; CODE XREF from main @ 0x4055a8
│    ┌──> 0x00405443      48 89 ef                    mov     rdi, rbp
│    ╎│   0x00405446      e8 d5 f0 ff ff              call    imp.QApplication::~QApplication() ; method.Q
│    ╎│   0x0040544b      4c 89 ef                    mov     rdi, r13 ; int64_t arg1
│    ╎│   0x0040544e      e8 ed 02 00 00              call    fcn.00405740 ; fcn.00405740
│    ╎│   0x00405453      48 83 c4 78                 add     rsp, 0x78
│    ╎│   0x00405457      44 89 e0                    mov     eax, r12d
│    ╎│   0x0040545a      5b                          pop     rbx
│    ╎│   0x0040545b      5d                          pop     rbp
│    ╎│   0x0040545c      41 5c                       pop     r12
│    ╎│   0x0040545e      41 5d                       pop     r13
│    ╎│   0x00405460      41 5e                       pop     r14
│    ╎│   0x00405462      41 5f                       pop     r15
│    ╎│   0x00405464      c3                          ret
│    ╎└─> 0x00405465      4c 8d 7c 24 48              lea     r15, [rsp + 0x48]
│    ╎    0x0040546a      89 c6                       mov     esi, eax ; unsigned long long arg2
│    ╎    0x0040546c      4c 89 ff                    mov     rdi, r15 ; int64_t arg1
│    ╎    0x0040546f      e8 2c 11 00 00              call    fcn.004065a0 ; fcn.004065a0
│    ╎    0x00405474      4c 8d 74 24 50              lea     r14, [rsp + 0x50]
│    ╎    0x00405479      ba 1d 00 00 00              mov     edx, 0x1d ; 29
│    ╎    0x0040547e      48 8d 35 21 84 00 00        lea     rsi, [rip + str.License_verification_failed.

          ; Omitted...

#+end_src

The string is loaded into the =rsi= register at the bottom of the code snippet, at
address =0x0040547e=.

There are two alternative branches shown in the previous disassembly. First,
some unknown function =fcn.00408e90= is called, and the return value is saved in
=eax=[fn::According to Section 3.2.3 and Figure 3.4 of the [[https://cs61.seas.harvard.edu/site/pdf/x86-64-abi-20210928.pdf][AMD64 calling
convention]], the first two arguments are passed in =rdi= and =rsi=, and the return
value is passed to the caller in =rax=.]. If the value of =eax= is not zero, the
jump to =0x00405465= is taken and the "License verification failed" string is
loaded into =rsi=; however, if the value of =eax= was zero, the jump is not
performed and the code from =0x00405434= to =0x00405464= is executed, returning from
=main=. This disassembly of =main= can be translated into the following pseudo-code.

#+begin_src C
int main() {
    /* ... */

    /*
     ,* Instructions 0x00405421..0x00405432.
     ,* Where 'func' corresponds to 'fcn.00408e90'.
     ,*/
    uint32_t result = func(1, 1);
    if (result == 0) {

        /*
         ,* Omiting instructions 0x00405434..0x00405464.
         ,* Contains call to 'imp.launchIDE', etc.
         ,*/

        return 0;
    }

    /*
     ,* Instructions 0x00405465..0x0040547e.
     ,* Omiting the call to 'fcn.004065a0'.
     ,*/
    const char* str = "License verification failed.\n";

    /* ... */
}
#+end_src

It looks like that =fcn.00408e90= function is doing some license verification, and
depending on its returned value, the IDE is launched or an error message is shown.

