reversing/gowin-eda.html

<div id="outline-container-locating-the-top-level-validation-function" class="outline-3">
<h3 id="locating-the-top-level-validation-function"><span class="section-number-3">2.1.</span> Locating the top-level validation function</h3>
<div class="outline-text-3" id="text-locating-the-top-level-validation-function">
<p>
From the strings we found, the &ldquo;License verification failed&rdquo; string is the most
promising. We can inspect its cross-references with the <code>axt</code> command. The <code>@
0x1234</code> syntax is used to execute an instruction at an specific address (instead
of the current one).
</p>

<div class="org-src-container">
<pre class="src src-nasm">[<span style="color: #2a5045;">0x0040563d</span>]&gt; axt @ <span style="color: #2a5045;">0x0040d8a6</span>
main <span style="color: #2a5045;">0x40547e</span> [DATA] <span style="color: #721045;">lea</span> <span style="color: #005f5f;">rsi</span>, str.License_verification_failed.
</pre>
</div>

<p>
There is only one cross-reference, a <code>lea</code> instruction inside the <code>main</code>
function. We can inspect the disassembly of that function with the <code>pdf</code>
command. I have filtered the output to only show the relevant instructions.
</p>

<div class="org-src-container">
<pre class="src src-nasm">[<span style="color: #2a5045;">0x0040d8a6</span>]&gt; pdf @ <span style="color: #2a5045;">0x40547e</span>

          <span style="color: #595959;">; </span><span style="color: #595959;">Omitted...</span>

&#9474;         <span style="color: #2a5045;">0x00405421</span>      be <span style="color: #2a5045;">01</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span>              <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">esi</span>, <span style="color: #2a5045;">1</span> <span style="color: #595959;">; </span><span style="color: #595959;">int64_t arg2</span>
&#9474;         <span style="color: #2a5045;">0x00405426</span>      bf <span style="color: #2a5045;">01</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span>              <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">edi</span>, <span style="color: #2a5045;">1</span> <span style="color: #595959;">; </span><span style="color: #595959;">int64_t arg1</span>
&#9474;         <span style="color: #2a5045;">0x0040542b</span>      e8 <span style="color: #2a5045;">60</span> <span style="color: #2a5045;">3a</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span>              <span style="color: #721045;">call</span>    fcn.00408e90 <span style="color: #595959;">; </span><span style="color: #595959;">fcn.00408e90</span>
&#9474;         <span style="color: #2a5045;">0x00405430</span>      <span style="color: #2a5045;">85</span> c0                       <span style="color: #721045;">test</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">eax</span>
&#9474;     &#9484;&#9472;&lt; <span style="color: #2a5045;">0x00405432</span>      <span style="color: #2a5045;">75</span> <span style="color: #2a5045;">31</span>                       <span style="color: #721045;">jne</span>     <span style="color: #2a5045;">0x405465</span>
&#9474;     &#9474;   <span style="color: #2a5045;">0x00405434</span>      <span style="color: #2a5045;">8b</span> <span style="color: #2a5045;">7c</span> <span style="color: #2a5045;">24</span> <span style="color: #2a5045;">1c</span>                 <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">edi</span>, <span style="color: #0031a9;">dword</span> [<span style="color: #005f5f;">rsp</span> + <span style="color: #2a5045;">0x1c</span>]
&#9474;     &#9474;   <span style="color: #2a5045;">0x00405438</span>      <span style="color: #2a5045;">4c</span> <span style="color: #2a5045;">89</span> f6                    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">rsi</span>, <span style="color: #005f5f;">r14</span>
&#9474;     &#9474;   <span style="color: #2a5045;">0x0040543b</span>      e8 f0 ee ff ff              <span style="color: #721045;">call</span>    imp.launchIDE(<span style="color: #721045;">int</span>, char**) <span style="color: #595959;">; </span><span style="color: #595959;">sy</span>
&#9474;     &#9474;   <span style="color: #2a5045;">0x00405440</span>      <span style="color: #2a5045;">41</span> <span style="color: #2a5045;">89</span> c4                    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">r12d</span>, <span style="color: #005f5f;">eax</span>
&#9474;     &#9474;   <span style="color: #595959;">; </span><span style="color: #595959;">CODE XREF from main @ 0x4055a8</span>
&#9474;    &#9484;&#9472;&#9472;&gt; <span style="color: #2a5045;">0x00405443</span>      <span style="color: #2a5045;">48</span> <span style="color: #2a5045;">89</span> ef                    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">rdi</span>, <span style="color: #005f5f;">rbp</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x00405446</span>      e8 d5 f0 ff ff              <span style="color: #721045;">call</span>    imp.QApplication::~QApplication() <span style="color: #595959;">; </span><span style="color: #595959;">method.Q</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x0040544b</span>      <span style="color: #2a5045;">4c</span> <span style="color: #2a5045;">89</span> ef                    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">rdi</span>, <span style="color: #005f5f;">r13</span> <span style="color: #595959;">; </span><span style="color: #595959;">int64_t arg1</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x0040544e</span>      e8 ed <span style="color: #2a5045;">02</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span>              <span style="color: #721045;">call</span>    fcn.00405740 <span style="color: #595959;">; </span><span style="color: #595959;">fcn.00405740</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x00405453</span>      <span style="color: #2a5045;">48</span> <span style="color: #2a5045;">83</span> c4 <span style="color: #2a5045;">78</span>                 <span style="color: #721045;">add</span>     <span style="color: #005f5f;">rsp</span>, <span style="color: #2a5045;">0x78</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x00405457</span>      <span style="color: #2a5045;">44</span> <span style="color: #2a5045;">89</span> e0                    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">r12d</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x0040545a</span>      <span style="color: #2a5045;">5b</span>                          <span style="color: #721045;">pop</span>     <span style="color: #005f5f;">rbx</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x0040545b</span>      <span style="color: #2a5045;">5d</span>                          <span style="color: #721045;">pop</span>     <span style="color: #005f5f;">rbp</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x0040545c</span>      <span style="color: #2a5045;">41</span> <span style="color: #2a5045;">5c</span>                       <span style="color: #721045;">pop</span>     <span style="color: #005f5f;">r12</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x0040545e</span>      <span style="color: #2a5045;">41</span> <span style="color: #2a5045;">5d</span>                       <span style="color: #721045;">pop</span>     <span style="color: #005f5f;">r13</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x00405460</span>      <span style="color: #2a5045;">41</span> <span style="color: #2a5045;">5e</span>                       <span style="color: #721045;">pop</span>     <span style="color: #005f5f;">r14</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x00405462</span>      <span style="color: #2a5045;">41</span> <span style="color: #2a5045;">5f</span>                       <span style="color: #721045;">pop</span>     <span style="color: #005f5f;">r15</span>
&#9474;    &#9550;&#9474;   <span style="color: #2a5045;">0x00405464</span>      c3                          <span style="color: #721045;">ret</span>
&#9474;    &#9550;&#9492;&#9472;&gt; <span style="color: #2a5045;">0x00405465</span>      <span style="color: #2a5045;">4c</span> <span style="color: #2a5045;">8d</span> <span style="color: #2a5045;">7c</span> <span style="color: #2a5045;">24</span> <span style="color: #2a5045;">48</span>              <span style="color: #721045;">lea</span>     <span style="color: #005f5f;">r15</span>, [<span style="color: #005f5f;">rsp</span> + <span style="color: #2a5045;">0x48</span>]
&#9474;    &#9550;    <span style="color: #2a5045;">0x0040546a</span>      <span style="color: #2a5045;">89</span> c6                       <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">esi</span>, <span style="color: #005f5f;">eax</span> <span style="color: #595959;">; </span><span style="color: #595959;">unsigned long long arg2</span>
&#9474;    &#9550;    <span style="color: #2a5045;">0x0040546c</span>      <span style="color: #2a5045;">4c</span> <span style="color: #2a5045;">89</span> ff                    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">rdi</span>, <span style="color: #005f5f;">r15</span> <span style="color: #595959;">; </span><span style="color: #595959;">int64_t arg1</span>
&#9474;    &#9550;    <span style="color: #2a5045;">0x0040546f</span>      e8 <span style="color: #2a5045;">2c</span> <span style="color: #2a5045;">11</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span>              <span style="color: #721045;">call</span>    fcn.004065a0 <span style="color: #595959;">; </span><span style="color: #595959;">fcn.004065a0</span>
&#9474;    &#9550;    <span style="color: #2a5045;">0x00405474</span>      <span style="color: #2a5045;">4c</span> <span style="color: #2a5045;">8d</span> <span style="color: #2a5045;">74</span> <span style="color: #2a5045;">24</span> <span style="color: #2a5045;">50</span>              <span style="color: #721045;">lea</span>     <span style="color: #005f5f;">r14</span>, [<span style="color: #005f5f;">rsp</span> + <span style="color: #2a5045;">0x50</span>]
&#9474;    &#9550;    <span style="color: #2a5045;">0x00405479</span>      ba <span style="color: #2a5045;">1d</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span>              <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0x1d</span> <span style="color: #595959;">; </span><span style="color: #595959;">29</span>
&#9474;    &#9550;    <span style="color: #2a5045;">0x0040547e</span>      <span style="color: #2a5045;">48</span> <span style="color: #2a5045;">8d</span> <span style="color: #2a5045;">35</span> <span style="color: #2a5045;">21</span> <span style="color: #2a5045;">84</span> <span style="color: #2a5045;">00</span> <span style="color: #2a5045;">00</span>        <span style="color: #721045;">lea</span>     <span style="color: #005f5f;">rsi</span>, [rip + str.License_verification_failed.

          <span style="color: #595959;">; </span><span style="color: #595959;">Omitted...</span>

</pre>
</div>

<p>
The string is loaded into the <code>rsi</code> register at the bottom of the code snippet, at
address <code>0x0040547e</code>.
</p>

<p>
There are two alternative branches shown in the previous disassembly. First,
some unknown function <code>fcn.00408e90</code> is called, and the return value is saved in
<code>eax</code><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. If the value of <code>eax</code> is not zero, the
jump to <code>0x00405465</code> is taken and the &ldquo;License verification failed&rdquo; string is
loaded into <code>rsi</code>; however, if the value of <code>eax</code> was zero, the jump is not
performed and the code from <code>0x00405434</code> to <code>0x00405464</code> is executed, returning from
<code>main</code>. This disassembly of <code>main</code> can be translated into the following pseudo-code.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #0031a9;">int</span> <span style="color: #3f578f;">main</span>() {
    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>

    <span style="color: #595959;">/*</span>
<span style="color: #595959;">     * Instructions 0x00405421..0x00405432.</span>
<span style="color: #595959;">     * Where 'func' corresponds to 'fcn.00408e90'.</span>
<span style="color: #595959;">     */</span>
    <span style="color: #0031a9;">uint32_t</span> <span style="color: #005f5f;">result</span> = func(<span style="color: #2a5045;">1</span>, <span style="color: #2a5045;">1</span>);
    <span style="color: #972500;">if</span> (result == <span style="color: #2a5045;">0</span>) {

        <span style="color: #595959;">/*</span>
<span style="color: #595959;">         * Omiting instructions 0x00405434..0x00405464.</span>
<span style="color: #595959;">         * Contains call to 'imp.launchIDE', etc.</span>
<span style="color: #595959;">         */</span>

        <span style="color: #972500;">return</span> <span style="color: #2a5045;">0</span>;
    }

    <span style="color: #595959;">/*</span>
<span style="color: #595959;">     * Instructions 0x00405465..0x0040547e.</span>
<span style="color: #595959;">     * Omiting the call to 'fcn.004065a0'.</span>
<span style="color: #595959;">     */</span>
    <span style="color: #972500;">const</span> <span style="color: #0031a9;">char</span>* <span style="color: #005f5f;">str</span> = <span style="color: #005e8b;">"License verification failed.</span><span style="color: #972500;">\n</span><span style="color: #005e8b;">"</span>;

    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
}
</pre>
</div>

<p>
It looks like that <code>fcn.00408e90</code> function is doing some license verification, and
depending on its returned value, the IDE is launched or an error message is shown.
</p>
</div>
</div>
