reversing/gowin-eda.org
** Analyzing the top-level validation function
:PROPERTIES:
:CUSTOM_ID: analyzing-the-top-level-validation-function
:END:

If we /disassemble/ this function with =pdf=, we see that it's somewhat big. By
using the =pdg= command on that function, we can instead /decompile/ it using the
[[https://github.com/rizinorg/rz-ghidra][Ghidra plugin]]. The following code shows the relevant parts of the
decompilation, after cleaning the type casts and simplifying the function names.

#+begin_src C++
int fcn00408e90(int64_t arg1, int64_t arg2) {
    uVar2 = fcn0040d570(0, 0, 0);
    arg1_00 = imp.operator new[](unsigned long)((uVar2 + 1));
    fcn0040d570(arg1_00, uVar2, 0);
    /* ... */
    var_40h = QString.fromAscii_helper(arg1_00, uVar5);
    /* ... */
    QString.fromUtf8_helper(&var_40h, "/gwlicense.ini", 0xe);
    QString.append(&var_48h, &var_40h);

    /* ... */

    iVar3 = fcn00407b40((int64_t)&var_48h, (int64_t)&var_58h);
    if (*var_48h == 0) {
        /* ... */

        var_40h = QString.fromAscii_helper("^(.*):(\\d+)$", 0xc);
        QRegExp::PatternSyntax(&var_50h, &var_40h, 1, 0);
        /* ... */
        cVar1 = QRegExp.exactMatch(&var_50h, &var_58h);

        if (cVar1 == '\0') {
            uVar4 = fcn00407f70((int64_t)&var_58h, arg1 & 0xff, arg2 & 0xff);
        } else {
            /* ... */
            uVar4 = fcn00408170((int64_t)&var_48h, arg2_00, arg1 & 0xff, arg2 & 0xff, 0, in_stack_00000078);
            /* ... */
        }
    } else {
        /* ... */
        uVar4 = 0x10;
    }

    /* ... */
    return uVar4;
}
#+end_src

From this, we can see the general structure of the function.

1. Calls some =fcn.0040d570= function twice, first with null values (likely to
   calculate some size), and then with an allocated buffer. This buffer is
   converted between ASCII and UTF-8, and the string ="/gwlicense.ini"= is
   appended to it.
2. Calls some =fcn.00407b40= function unconditionally, passing the result of the
   appended string. The normal execution path continues if this function sets
   the value of =*var_48h= to zero, probably because that indicates that it
   processed the entire input string up to the null-terminator. If the string
   was not processed entirely, =0x10= is returned.
3. A new =QRegExp= object is initialized with the pattern ~"^(.*):(\\d+)$"~. It is
   checked against the second argument of =fcn.00407b40=, likely because that
   function writes something the buffer which may or may not match the regexp.
4. If the regexp matches, function =fcn.00407f70= is called and its return value
   is propagated. Otherwise, if the regexp didn't match function =fcn.00408170= is
   called, also propagating its return value.

This can be converted into simpler pseudo-code:

#+begin_src C++
int fcn00408e90(int64_t arg1, int64_t arg2) {
    int length = fcn0040d570(0, 0, 0);
    char* base_path = new char[length + 1];
    fcn0040d570(base_path, length, 0);
    QString full_path = base_path + "/gwlicense.ini";

    /* ... */

    QString out_value;
    fcn00407b40(full_path, &out_value);
    if (*full_path != '\0') {
        /* ... */
        return 0x10;
    }

    /* ... */

    QRegExp rx("^(.*):(\\d+)$");
    if (!rx.exactMatch(out_value)) {
        return fcn00407f70(out_value, arg1, arg2);
    } else {
        /* ... */
        return fcn00408170(full_path, out_value, arg1, arg2, 0, ...);
    }
}
#+end_src

