reversing/gowin-eda.html

<div id="outline-container-analyzing-the-top-level-validation-function" class="outline-3">
<h3 id="analyzing-the-top-level-validation-function"><span class="section-number-3">2.2.</span> Analyzing the top-level validation function</h3>
<div class="outline-text-3" id="text-analyzing-the-top-level-validation-function">
<p>
If we <i>disassemble</i> this function with <code>pdf</code>, we see that it&rsquo;s somewhat big. By
using the <code>pdg</code> command on that function, we can instead <i>decompile</i> it using the
<a href="https://github.com/rizinorg/rz-ghidra">Ghidra plugin</a>. The following code shows the relevant parts of the
decompilation, after cleaning the type casts and simplifying the function names.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #0031a9;">int</span> <span style="color: #3f578f;">fcn00408e90</span>(<span style="color: #0031a9;">int64_t</span> <span style="color: #005f5f;">arg1</span>, <span style="color: #0031a9;">int64_t</span> <span style="color: #005f5f;">arg2</span>) {
    uVar2 = fcn0040d570(<span style="color: #2a5045;">0</span>, <span style="color: #2a5045;">0</span>, <span style="color: #2a5045;">0</span>);
    arg1_00 = imp.<span style="color: #972500;">operator</span> <span style="color: #972500;">new</span>[](<span style="color: #0031a9;">unsigned</span> <span style="color: #0031a9;">long</span>)((uVar2 + <span style="color: #2a5045;">1</span>));
    fcn0040d570(arg1_00, uVar2, <span style="color: #2a5045;">0</span>);
    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
    var_40h = QString.fromAscii_helper(arg1_00, uVar5);
    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
    QString.fromUtf8_helper(&amp;var_40h, <span style="color: #005e8b;">"/gwlicense.ini"</span>, <span style="color: #2a5045;">0xe</span>);
    QString.append(&amp;var_48h, &amp;var_40h);

    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>

    iVar3 = fcn00407b40((<span style="color: #0031a9;">int64_t</span>)&amp;var_48h, (<span style="color: #0031a9;">int64_t</span>)&amp;var_58h);
    <span style="color: #972500;">if</span> (*var_48h == <span style="color: #2a5045;">0</span>) {
        <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>

        var_40h = QString.fromAscii_helper(<span style="color: #005e8b;">"^(.*):(</span><span style="color: #972500;">\\</span><span style="color: #005e8b;">d+)$"</span>, <span style="color: #2a5045;">0xc</span>);
        <span style="color: #2a5045;">QRegExp</span>::PatternSyntax(&amp;var_50h, &amp;var_40h, <span style="color: #2a5045;">1</span>, <span style="color: #2a5045;">0</span>);
        <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
        cVar1 = QRegExp.exactMatch(&amp;var_50h, &amp;var_58h);

        <span style="color: #972500;">if</span> (cVar1 == <span style="color: #005e8b;">'</span><span style="color: #972500;">\0</span><span style="color: #005e8b;">'</span>) {
            uVar4 = fcn00407f70((<span style="color: #0031a9;">int64_t</span>)&amp;var_58h, arg1 &amp; <span style="color: #2a5045;">0xff</span>, arg2 &amp; <span style="color: #2a5045;">0xff</span>);
        } <span style="color: #972500;">else</span> {
            <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
            uVar4 = fcn00408170((<span style="color: #0031a9;">int64_t</span>)&amp;var_48h, arg2_00, arg1 &amp; <span style="color: #2a5045;">0xff</span>, arg2 &amp; <span style="color: #2a5045;">0xff</span>, <span style="color: #2a5045;">0</span>, in_stack_00000078);
            <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
        }
    } <span style="color: #972500;">else</span> {
        <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
        uVar4 = <span style="color: #2a5045;">0x10</span>;
    }

    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
    <span style="color: #972500;">return</span> uVar4;
}
</pre>
</div>

<p>
From this, we can see the general structure of the function.
</p>

<ol class="org-ol">
<li>Calls some <code>fcn.0040d570</code> function twice, first with null values (likely to
calculate some size), and then with an allocated buffer. This buffer is
converted between ASCII and UTF-8, and the string <code>"/gwlicense.ini"</code> is
appended to it.</li>
<li>Calls some <code>fcn.00407b40</code> function unconditionally, passing the result of the
appended string. The normal execution path continues if this function sets
the value of <code>*var_48h</code> to zero, probably because that indicates that it
processed the entire input string up to the null-terminator. If the string
was not processed entirely, <code>0x10</code> is returned.</li>
<li>A new <code>QRegExp</code> object is initialized with the pattern <code>"^(.*):(\\d+)$"</code>. It is
checked against the second argument of <code>fcn.00407b40</code>, likely because that
function writes something the buffer which may or may not match the regexp.</li>
<li>If the regexp matches, function <code>fcn.00407f70</code> is called and its return value
is propagated. Otherwise, if the regexp didn&rsquo;t match function <code>fcn.00408170</code> is
called, also propagating its return value.</li>
</ol>

<p>
This can be converted into simpler pseudo-code:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #0031a9;">int</span> <span style="color: #3f578f;">fcn00408e90</span>(<span style="color: #0031a9;">int64_t</span> <span style="color: #005f5f;">arg1</span>, <span style="color: #0031a9;">int64_t</span> <span style="color: #005f5f;">arg2</span>) {
    <span style="color: #0031a9;">int</span> <span style="color: #005f5f;">length</span> = fcn0040d570(<span style="color: #2a5045;">0</span>, <span style="color: #2a5045;">0</span>, <span style="color: #2a5045;">0</span>);
    <span style="color: #0031a9;">char</span>* <span style="color: #005f5f;">base_path</span> = <span style="color: #972500;">new</span> <span style="color: #0031a9;">char</span>[length + <span style="color: #2a5045;">1</span>];
    fcn0040d570(base_path, length, <span style="color: #2a5045;">0</span>);
    <span style="color: #0031a9;">QString</span> <span style="color: #005f5f;">full_path</span> = base_path + <span style="color: #005e8b;">"/gwlicense.ini"</span>;

    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>

    <span style="color: #0031a9;">QString</span> <span style="color: #005f5f;">out_value</span>;
    fcn00407b40(full_path, &amp;out_value);
    <span style="color: #972500;">if</span> (*full_path != <span style="color: #005e8b;">'</span><span style="color: #972500;">\0</span><span style="color: #005e8b;">'</span>) {
        <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
        <span style="color: #972500;">return</span> <span style="color: #2a5045;">0x10</span>;
    }

    <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>

    <span style="color: #0031a9;">QRegExp</span> <span style="color: #005f5f;">rx</span>(<span style="color: #005e8b;">"^(.*):(</span><span style="color: #972500;">\\</span><span style="color: #005e8b;">d+)$"</span>);
    <span style="color: #972500;">if</span> (<span style="color: #972500; font-weight: bold;">!</span>rx.exactMatch(out_value)) {
        <span style="color: #972500;">return</span> fcn00407f70(out_value, arg1, arg2);
    } <span style="color: #972500;">else</span> {
        <span style="color: #595959;">/* </span><span style="color: #595959;">...</span><span style="color: #595959;"> */</span>
        <span style="color: #972500;">return</span> fcn00408170(full_path, out_value, arg1, arg2, <span style="color: #2a5045;">0</span>, ...);
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">According to Section 3.2.3 and Figure 3.4 of the <a href="https://cs61.seas.harvard.edu/site/pdf/x86-64-abi-20210928.pdf">AMD64 calling
convention</a>, the first two arguments are passed in <code>rdi</code> and <code>rsi</code>, and the return
value is passed to the caller in <code>rax</code>.</p></div></div>


</div>
</div></div>
</body>
</html>
